benchmark/results/20260919-220307/adaptive-ctrl-w2-r1.txt
Running 15s test @ http://127.0.0.1:8080/work
  2 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.07ms    8.10ms 164.36ms   99.13%
    Req/Sec    23.56k     1.83k   25.89k    85.91%
  Latency Distribution
     50%    1.43ms
     75%    1.65ms
     90%    2.44ms
     99%    7.72ms
  700741 requests in 15.02s, 128.47MB read
  Non-2xx or 3xx responses: 345397
Requests/sec:  46666.36
Transfer/sec:      8.56MB