benchmark/results/20260919-220307/adaptive-ctrl-w2-r2.txt
Running 15s test @ http://127.0.0.1:8080/work
  2 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.36ms    0.86ms  17.74ms   80.06%
    Req/Sec    23.20k     2.56k   26.84k    86.42%
  Latency Distribution
     50%    1.21ms
     75%    1.60ms
     90%    2.53ms
     99%    3.75ms
  699418 requests in 2.31m, 128.77MB read
  Socket errors: connect 0, read 0, write 0, timeout 64
  Non-2xx or 3xx responses: 360777
Requests/sec:   5044.56
Transfer/sec:      0.93MB