benchmark/results/20260919-220307/adaptive-huge-w2-r1.txt
Running 15s test @ http://127.0.0.1:8080/work
  2 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.23ms    1.41ms  16.48ms   61.11%
    Req/Sec     9.96k     2.23k   15.13k    63.33%
  Latency Distribution
     50%    3.17ms
     75%    4.17ms
     90%    5.20ms
     99%    6.61ms
  297705 requests in 15.03s, 49.68MB read
Requests/sec:  19808.09
Transfer/sec:      3.31MB