benchmark/results/20260919-220307/adaptive-huge-w2-r2.txt
Running 15s test @ http://127.0.0.1:8080/work
  2 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.92ms    1.17ms  13.24ms   73.91%
    Req/Sec    11.02k     2.03k   16.38k    70.67%
  Latency Distribution
     50%    2.52ms
     75%    3.75ms
     90%    4.50ms
     99%    6.14ms
  329041 requests in 15.01s, 54.91MB read
Requests/sec:  21919.11
Transfer/sec:      3.66MB