benchmark/results/20260919-220307/adaptive-huge-w4-r3.txt
Running 15s test @ http://127.0.0.1:8080/work
  2 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.05ms  783.51us  18.29ms   84.23%
    Req/Sec    15.32k     1.98k   19.74k    74.00%
  Latency Distribution
     50%    1.94ms
     75%    2.35ms
     90%    2.88ms
     99%    4.42ms
  457801 requests in 15.02s, 76.40MB read
Requests/sec:  30474.20
Transfer/sec:      5.09MB