benchmark/results/20260919-220307/adaptive-many16-w2-r3.txt
Running 15s test @ http://127.0.0.1:8080/work
  2 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.82ms    1.00ms  18.50ms   75.63%
    Req/Sec    11.43k     1.62k   15.55k    69.00%
  Latency Distribution
     50%    2.56ms
     75%    3.41ms
     90%    4.08ms
     99%    5.78ms
  341227 requests in 15.01s, 56.95MB read
Requests/sec:  22728.77
Transfer/sec:      3.79MB