benchmark/results/20260919-220307/baseline-w1-r1.txt
Running 15s test @ http://127.0.0.1:8080/work
  2 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.40ms    1.13ms  18.71ms   69.31%
    Req/Sec     7.31k     1.13k   11.64k    79.00%
  Latency Distribution
     50%    4.38ms
     75%    5.16ms
     90%    5.69ms
     99%    7.04ms
  218809 requests in 15.04s, 36.52MB read
Requests/sec:  14548.41
Transfer/sec:      2.43MB