benchmark/results/20260919-220307/baseline-w1-r3.txt
Running 15s test @ http://127.0.0.1:8080/work
  2 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.29ms    1.38ms  28.94ms   77.65%
    Req/Sec     7.54k     1.39k   11.45k    77.33%
  Latency Distribution
     50%    4.19ms
     75%    5.09ms
     90%    5.69ms
     99%    7.91ms
  225824 requests in 15.05s, 37.69MB read
Requests/sec:  15003.79
Transfer/sec:      2.50MB