benchmark/results/20260919-220307/baseline-w4-r1.txt
Running 15s test @ http://127.0.0.1:8080/work
  2 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.74ms  807.49us  18.69ms   77.38%
    Req/Sec    14.91k     1.17k   16.79k    85.00%
  Latency Distribution
     50%    1.73ms
     75%    2.10ms
     90%    2.49ms
     99%    4.07ms
  445810 requests in 15.04s, 74.40MB read
Requests/sec:  29637.52
Transfer/sec:      4.95MB