benchmark/results/20260919-220307/fixed-w2-r3.txt
Running 15s test @ http://127.0.0.1:8080/work
  2 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.80ms    1.19ms  16.76ms   79.79%
    Req/Sec    11.52k     1.94k   16.79k    72.67%
  Latency Distribution
     50%    2.42ms
     75%    3.56ms
     90%    4.21ms
     99%    6.21ms
  344160 requests in 15.01s, 57.44MB read
Requests/sec:  22925.15
Transfer/sec:      3.83MB