benchmark/results/20260919-220307/fixed-w4-r2.txt
Running 15s test @ http://127.0.0.1:8080/work
  2 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.64ms  659.08us  14.98ms   71.33%
    Req/Sec    16.17k     1.03k   18.45k    79.00%
  Latency Distribution
     50%    1.68ms
     75%    2.02ms
     90%    2.33ms
     99%    2.90ms
  483177 requests in 15.02s, 80.64MB read
Requests/sec:  32172.50
Transfer/sec:      5.37MB