benchmark/results/20260919-220307/fixed-w4-r3.txt
Running 15s test @ http://127.0.0.1:8080/work
  2 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.69ms    1.46ms  49.79ms   97.56%
    Req/Sec    16.36k     1.30k   18.46k    89.00%
  Latency Distribution
     50%    1.66ms
     75%    1.97ms
     90%    2.27ms
     99%    3.75ms
  489298 requests in 15.04s, 81.66MB read
Requests/sec:  32533.63
Transfer/sec:      5.43MB